{
    "BOT": "Alhamdulillah <br> akhirnya kapanggih <br> ha &ltbr&gt ha",
    "HELLO": "Hey, I'm so glad you set EstherBot up! Do you want to tell Esther that you're talking to her bot? %[Tell her](postback:twitter)",
    "TELL HER": "Let's tweet @ Esther so she knows you're setting a bot up. Here's a tweet that's ready to go: %[Tweet Esther](http://bit.ly/estherbot-tweet)",
    "I LOVE YOU": "Awh, shucks! I love you too!",
    "LEARN ABOUT ESTHER": "<b>WATTTTTTTT WATTTTT</b>",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, EstherBot is back.",
    "BAT01CE601":"KKS: BAT01CE601\nTEXT: BUCHOLZ MAIN TRANSF\nSTATUS: ALARM\nREASON: Main transformer Bucholz Relay activated\nACTION: Contact the protection department and/or ABB",
    "BAT01CT001":"KKS: BAT01CT001\nTEXT: WINDING TEMPERATURE\nSTATUS: > HIGH\nREASON: Main transformer winding temperature supervision, stage1, has activated\nACTION: Check that all six cooling fans of main transformer are in operation. Check coolers for cleanliness",
    "BAT01CT003":"KKS: BAT01CT003\nTEXT: OIL TEMPERATURE\nSTATUS: > HIGH\nREASON: Main transformer oil temperature oil temperature supervision, stage 1, has activated.\nACTION: Check that all six cooling fans of main transformer are in operation. Check coolers for cleanliness",
    "BAT01EG801":"KKS: BAT01EG801\nTEXT: AUX VOLT TRANSFORMER\nSTATUS: FAULT\nREASON: Common alarm.\nACTION: Check MCB's, incoming supply and over-current relay",
    "BAT01EG803":"KKS: BAT01EG803\nTEXT: TRANSFORMER COOLING\nSTATUS: FAULT\nREASON: One or more of the six cooling fans are not in operation\nACTION: Check that all MCB's for cooling fans are in service position. Check over-current relays. If necessary, investigate reason for relay actuating and reset",
    "BFA00EA804":"KKS: BFA00EA804\nTEXT: 0.4kV UNIT BD BFA04\nSTATUS: DIST\nREASON: Over-current protection in one of the breaker modules of BFA04 has activated (white disturbance lamp on)\nACTION: Check which MCB has tripped. Investigate reason for over-current protection actuation. After elimination of fault, reset over-current relay",
    "BFA00EA805":"KKS: BFA00EA805\nTEXT: 0.4kV UNIT BD BFA04\nSTATUS: LCINT\nREASON: One of the breaker modules is racked out or in test position\nACTION: Return breaker module to operating position",
    "BFA00GS101":"KKS: BFA00GS101\nTEXT: 0.4kV INCOMING FEEDER\nSTATUS: OVOLT\nREASON: Over-voltage on BFA infeed\nACTION: Check incoming voltage and grid voltage, adjust voltage by changing generator output voltage and / or tap position of main transformer",
    "BFA00GS101":"KKS: BFA00GS101\nTEXT: 0.4kV INCOMING FEEDER\nSTATUS: UVOLT\nREASON: Under-voltage on BFA infeed\nACTION: Check incoming voltage and grid voltage, adjust voltage by changing generator output voltage and / or tap position of main transformer",
    "BFA00GS501":"KKS: BFA00GS501\nTEXT: 0.4kV RECLOSG DEVICE\nSTATUS: FAULT\nREASON: Auxiliary voltage for re-closing system missing\nACTION: Check 24 Vdc auxiliary voltage at terminals of re-closing device XT374 A-E in panel BFA04. If no auxiliary voltage is available, check 24 Vdc MCB's Q23 and Q24 in BJA01B panel",
    "BFA00GS501":"KKS: BFA00GS501\nTEXT: 0.4kV UNIT BOARD BFA04\nSTATUS: UVOLT\nREASON: Under-voltage in BFA panel\nACTION: Check incoming voltage and grid voltage, adjust voltage by changing generator output voltage and / or tap position of main transformer",
    "BFA00GS501":"KKS: BFA00GS501\nTEXT: 0.4kV CONTROL VOLTAGE\nSTATUS: < MIN\nREASON: Control voltage for re-closing device is low\nACTION: Check MCB in +BFA04B01 and incoming supply",
    "BFT01CE601":"KKS: BFT01CE601\nTEXT: BUCHOLZ AUX TRANSF\nSTATUS: ALARM\nREASON: Auxiliary transformer Bucholz Relay has activated\nACTION: Contact ABB",
    "BFT01CL001":"KKS: BFT01CL001\nTEXT: TRANSF OIL LEVEL\nSTATUS: < LOW\nREASON: Oil level in aux. transformer is low\nACTION: Check for oil leaks. Check indication on expansion tank. Refill with insulating oil(refer to manufacturers instructinos)",
    "BFT01CT001":"KKS: BFT01CT001\nTEXT: OIL TEMPERATURE\nSTATUS: > HIGH\nREASON: Auxiliary transformer oil temperature oil temperature supervision has activated\nACTION: Check radiators for cleanliness",
    "BJA02GS001":"KKS: BJA02GS001\nTEXT: NO BREAK SUPP AUX\nSTATUS: FAILR\nREASON: \nACTION: ",
    "BPA00EA100":"KKS: BPA00EA100\nTEXT: PROTECTION CRITERIA\nSTATUS: ACTIVAT\nREASON: Emergency off-order for starting device due to: FG starting equipment ON and Lube oil (or) pressure< 60% for more than 3 sec (or) Fire protection activated (or) Bearing metal temperature > max trip (or) Starting equipment failure (or) Generator transformer protection activated (or) Excitation equipment disturbed\nACTION: Check local indication panel at starting device for trip indications. Investigate reason and rectify fault. Refer to C&I diagrams to find out which signal has caused the trip of the starting system (C&I diagrams, section: FG starting equipment BPA) Investigate reason and rectify fault",
    "BPA00EA801":"KKS: BPA00EA801\nTEXT: STARTING EQUIPMENT\nSTATUS: DIST\nREASON: Disturbance of starting device with low voltage power supply (BFA, 380Vac) not in under-voltage condition at the same time for more than 10seconds\nACTION: Check all breakers for the starting device are in the correct operating position ( refer to picture xxx/xxx on POS station) Clear reason for breaker mis-operation and restart. Check rotor barring system is in correct position(i.e. the piston of the rotor barring device must be in its lower end positition) as soon as starting isolator BAA20GS100 is switched ON",
    "BPA00EA802":"KKS: BPA00EA802\nTEXT: START MAIN BREAKER\nSTATUS: DIST\nREASON: Earth fault on 2.15 kV system (or) Fault of starting main breaker BBA00GS201 (or) Fault of control voltage\nACTION: If earth fault is detected, check insulation of 2.15kV system and locate faulty/dirty parts. If the disturbance lamp of the starting main breaker BBA00GS201 is illuminated, check for both control voltages, tripped MCB's in control cabinet, breaker not in test position or local/remote selector switch not in remote position",
    "BPA00EA803":"KKS: BPA00EA803\nTEXT: START MAIN BREAKER\nSTATUS: LCINT\nREASON: Operating selection switch of starting main breaker is set to 'local' position\nACTION: Set operating selection switch of starting main breaker back to remote positoin",
    "BPA00EA804":"KKS: BPA00EA804\nTEXT: START SELEC BOARD\nSTATUS: FAULT\nREASON: Fault on selection isolators BCA00GS***\nACTION: Check MCB's for control and operating voltages",
    "BPA01EG801":"KKS: BPA01EG801\nTEXT: STARTING EQUIPMENT\nSTATUS: WARN\nREASON: Collective alarm indication from starting device\nACTION: Check on the local indication panel of the starting device which alarm has been actuated and investigate reason.(Refer to starting device manual for details)",
    "BPA01EG802":"KKS: BPA01EG802\nTEXT: STARTING EQUIPMENT\nSTATUS: FAULT\nREASON: Trip of starting device\nACTION: Check on the local indication panel of the starting device which alarm has been actuated and investigate reason.",
    "BTL00EG801":"KKS: BTL00EG801\nTEXT: 220V BATT CHARGER\nSTATUS: FAILR\nREASON: DC fault detection of batter charger activated\nACTION: Trouble shoot battery charger in accordance with operating instructions for battery charger",
    "BTM00EG801":"KKS: BTM00EG801\nTEXT: 24V UNIT BATT CHRG A\nSTATUS: FAILR\nREASON: Central fault of detection of battery charger, activated\nACTION: Trouble shoot battery charger in accordance with operating instructions for battery charger",
    "BTN00EG801":"KKS: BTN00EG801\nTEXT: 24V UNIT BATT CHRG B\nSTATUS: FAILR\nREASON: Central fault of detection of battery charger, activated\nACTION: Trouble shoot battery charger in accordance with operating instructions for battery charger",
    "BUA00GS501":"KKS: BUA00GS501\nTEXT: 220VDC UNIT BOARD\nSTATUS: OVOLT\nREASON: Over-voltage at 220 Vdc panel BUA (relay K37 at BUA01B is energized)\nACTION: Check 220 Vdc battery voltage. If battery voltage is too high, check battery charger. Reset with push-button at BUA01B",
    "BUA00GS501":"KKS: BUA00GS501\nTEXT: 220VDC UNIT BOARD\nSTATUS: UVOLT\nREASON: Under-voltage at 220 Vdc panelBUA (relay K36 at BUA01B is energized)\nACTION: Check MCB in panel BUA01B. Investigate reason for tripping and reset with push-button at BUA01B. Check 220Vdc battery voltage. If battery voltage is too low, check battery charger",
    "BUA00GS501":"KKS: BUA00GS501\nTEXT: 220VDC UNIT BD EARTH\nSTATUS: FAULT\nREASON: Earth fault in 220 Vdc distribution system\nACTION: Localize defective insulation or equipment. Reset with push-button on earth fault device",
    "BUA00GS803":"KKS: BUA00GS803\nTEXT: 220VDC BD CONTR V\nSTATUS: FAILR\nREASON: BUA panel control voltage (24 Vdc) failure (relay K30 in panel BUA01B is de-energized)\nACTION: Check incoming 24Vdc voltage in panel BUA01B.Check fuse in panel BUA01B",
    "BUB00GS501":"KKS: BUB00GS501\nTEXT: 24VDC UNIT BD A\nSTATUS: OVOLT\nREASON: Over-voltage 0f 24 Vdc A system\nACTION: Check 24Vdc A battery voltage. If battery voltage is too high, check battery charger. Reset alarm with push-button at BUB01B",
    "BUB00GS501":"KKS: BUB00GS501\nTEXT: 24VDC UNIT BD A\nSTATUS: UVOLT\nREASON: Under-voltage of 24 Vdc A system\nACTION: Check MCB in panel BUB01B. Investigate reason for tripping and reset with push-button at BUB01B. Check 24Vdc A battery voltage. If battery voltage is too low, check battery charger",
    "BUB00GS801":"KKS: BUB00GS801\nTEXT: 24VDC UNIT BD A CV\nSTATUS: FAILR\nREASON: BUB panel control voltage (220 Vdc) failure (relay K30 in panel BUB01B is de-energized)\nACTION: Check incoming 220Vdc voltage in panel BUB01B. Check fuse in panel BUB01B",
    "BUC00GS501":"KKS: BUC00GS501\nTEXT: 24V DC UNIT BD B\nSTATUS: OVOLT\nREASON: Over-voltage of 24 Vdc B system\nACTION: Check 24 Vdc B battery voltage. If battery voltage is too high, check battery charger. Reset alarm with push-button at BUC01B",
    "BUC00GS501":"KKS: BUC00GS501\nTEXT: 24V DC uNIT BD B\nSTATUS: UVOLT\nREASON: Under-voltage of 24 Vdc B system\nACTION: Check MCB in panel BUC01B. Investigate reason for tripping and reset with push-button at BUC01B. Check 24Vdc A battery voltage. If battery voltage is too low, check battery charger",
    "BUC00GS801":"KKS: BUC00GS801\nTEXT: 24V DC UNIT BD B CV\nSTATUS: FAILR\nREASON: BUC panel control voltage (220 Vdc) failure (relay K30 in panel BUC01B is de-energized)\nACTION: Check incoming 220Vdc voltage in panel BUC01B. Check fuse in panel BUC01B",
    "CBA02GW001":"KKS: CBA02GW001\nTEXT: FUSE RACK\nSTATUS: FAILR\nREASON: One or more of the fuses or MCB's in CBA02 have blown\nACTION: Check which MCB or fuse has tripped. Investigate reason for tripping and rectify problem. Reset MCB or replace fuse",
    "CBA03GW001":"KKS: CBA03GW001\nTEXT: TURB PROTCUBICLE\nSTATUS: DIST\nREASON: Disturbance in panel CBA03 Common annuciation\nACTION: Check on print XT377 (panel +CBA03 / 004) which LED is illuminated. Investigate reason for disturbance (refer to electrical diagrams and O&M manuals, Dekontic-K) and rectify problem",
    "CBP01GW001":"KKS: CBP01GW001\nTEXT: SYNCHR CUBICLE DIST\nSTATUS: DIST\nREASON: Disturbance in panel CBA03 Common annuciation\nACTION: Check on supervision card XT377, location +CBP01/AA04, what kind of disturbance is present. Trouble shoot panel in accordance with synchronizing wiring diagram/electrical diagrams. Contact ABB.",
    "CEA01EA881":"KKS: CEA01EA881\nTEXT: 220V/24V CHARGER\nSTATUS: DIST\nREASON: 220 V battery charger failure (or) 24 V unit battery charger A failure (or) 24 V unitbattery charger B failure\nACTION: Refer to the accompanying charger alarm",
    "CEA01EA882":"KKS: CEA01EA882\nTEXT: 0.4kV/220V/24V UNIT BD\nSTATUS: DIST\nREASON: Summary alarm of 0.4kV/220V/24V unit board alarms\nACTION: Refer to the accompanying unit board alarm",
    "CEA01EG801":"KKS: CEA01EG801\nTEXT: GEN CB AIR SUPPLE\nSTATUS: FAULT\nREASON: Common alarm, generator circuit breaker: Compressor for generator circuit breaker fault (or) Generator circuit breaker run time exceeded (or) SF6 isolating gas pressure wrong\nACTION: Check air supply for correct pressure. Check SF6 isolating gas for correct pressure. If pressure is too low, contact ABB or refill it. Check indications at local indication panel. I there are any disturbance messages",
    "CEA01EG802":"KKS: CEA01EG802\nTEXT: GENERATOR SWITCHGEAR\nSTATUS: FAULT\nREASON: Auxiliary voltage for starting isolator earth switch fault (or) Failure on the 380 Vsupply to generator CB (or) Failure on the air cooling fans of the generator CB compartment (or) Temperature too high (or) Discrepancy of ON/OFF orders\nACTION: Check incoming auxiliary voltages in accordance with generator switch-gear module. If one of the MCB has tripped, investigate reason, rectify fault and reset. Check air conditioning unit in generator switch-gear and its temperature setting. Check for discrepancy on breakers (at POS)",
    "CEA01EG803":"KKS: CEA01EG803\nTEXT: OIL LEVEL TRANSFORMER BAT01\nSTATUS: < LOW\nREASON: Oil level within main transformer, BAT01, is low\nACTION: Check for leakages. Check local level indicator. Refill with insulating oil according to manufacturers instructions",
    "CEA01EG806":"KKS: CEA01EG806\nTEXT: 415V UNIT BD\nSTATUS: DIST SW\nREASON: 380 Vac infeed breaker BFA00GS101 or coupling breaker BFA00GS401 is disturbed\nACTION: Check breakers and locate fault (over-current)",
    "CEA01EG807":"KKS: CEA01EG807\nTEXT: 0.4kV UNIT BD BFA02/03\nSTATUS: LCINT\nREASON: 380 Vac infeed breaker BFA00GS101 or coupling breaker BFA00GS401 is in test or local position\nACTION: Put corresponding breaker back in normal operating posiiton",
    "CEA01EG808":"KKS: CEA01EG808\nTEXT: 0.4kV UNIT BD AUX VOL\nSTATUS: FAILR\nREASON: Failure in one of the supervision voltage supplies for the BFA panels(220 Vac/dc)\nACTION: Check if MCB Q10 in panel +BFA04F01 has tripped, investigate reason for MCB actuating and reset. Check 220Vdc supervision voltage in panel +BFA04",
    "CEA01EG809":"KKS: CEA01EG809\nTEXT: 48V DC UNIT BOARD\nSTATUS: DIST\nREASON: One of the 48Vdc solenoid valve supply MCB's, in panel BJA02, has tripped\nACTION: Locale tripped MCB in panel BJA02, investigate reason for MCB tripping and reset rectifying the fault",
    "CEA01EG810":"KKS: CEA01EG810\nTEXT: AUX CONTROL\nSTATUS: FAULT\nREASON: One of the MCB's in panel BJA01 or panel BJA02 has tripped\nACTION: Locale tripped MCB in panel BJA01 or BJA02, investigate reason for MCB tripping and reset after rectifying the fault",
    "CEA01EG811":"KKS: CEA01EG811\nTEXT: 24V DC AUX FEED IN\nSTATUS: FAILR\nREASON: 24 Vdc auxiliary voltage I or II BJA panel is missing\nACTION: Check if main breaker Q30 for auxiliary voltage I and Q33 for auxiliary voltage II in panel BJA01E are switched on. Check fuses F30, 31 and F33, 34 in panel BJA01E. If one of the fuses has blown, investigate reason replace fuse. Check 24Vac infeed from panel BUB01 and BUC01",
    "CEA01EG812":"KKS: CEA01EG812\nTEXT: AUX CONTROL AUX VOLT\nSTATUS: FAILR\nREASON: 220Vdc auxiliary voltage for BJA panel is missing\nACTION: Check if main breaker Q30 for 220Vdc auxiliary voltage in panel BJA01K is switched on. Check fuses F30, 31 in panel BJA01K. If one of the fuses has blown, investigate reason and replace fuse. Check MCB's Q4 and Q9. If one of the MCB's has tripped, investigate reason for MCB actuating and reset",
    "CEA01EG813":"KKS: CEA01EG813\nTEXT: 220V DC UNIT BOARD\nSTATUS: DIST SW\nREASON: Summary alarm for distrurbance of emergency cooling oil pump, jacking oil pumps or hp power oil emergency pump\nACTION: Check thermal over-current protections in the MCB's. Investigate reason and reset",
    "CEA01EG814":"KKS: CEA01EG814\nTEXT: DECONTIC CUBICLE\nSTATUS: DIST\nREASON: One of the module in panel CBA03 is disturbed (or) Cubicle temperature supervision has activated (or) Supply disturbance\nACTION: Locate defective/disturbed module and check reason for disturbance in accordance with PROCONTROL/Dekontic-K system description",
    "CEA01EG815":"KKS: CEA01EG815\nTEXT: SYNCHRONIZING CUBICLE\nSTATUS: DIST\nREASON: One of the modules in the synchronizing panel CBP01 is disturbed or the supply disturbed (or) Cubicle temperature supervision has activated (or) Supply disturbance\nACTION: Locate defective/disturbed module and check reason for disturbance",
    "CEA01EG817":"KKS: CEA01EG817\nTEXT: PROCONTROL CUBICLE\nSTATUS: DIST\nREASON: One of the modules in either panel CBA01 or CBA02 is disturbed (or) Cubicle temperature supervisoin has activated (or) Supply disturbance (or) Panel door is open\nACTION: Locate defective/disturbed module and check reason for disturbance in accordance with PROCONTROL system description",
    "CEA01EG819":"KKS: CEA01EG819\nTEXT: CONTROL CUBICLE\nSTATUS: DIST\nREASON: Common alarmfor panel disturbances\nACTION: Refer to accompanying alarm message",
    "CEA01EG820":"KKS: CEA01EG820\nTEXT: 0.4kV BOARD BFA05\nSTATUS: LCINT\nREASON: One of the breaker modules is racked out or in test position\nACTION: Return breaker module to operating position",
    "CEA01EG821":"KKS: CEA01EG821\nTEXT: 0.4kV BOARD BFA05\nSTATUS: DIST\nREASON: Over-current protection in one of the breaker modules of BFA05 has actuated (white disturbance lamp on)\nACTION: Check which MCB has tripped. Investigate reason for over-current protection actuation. After elimination of fault, reset over-current relay",
    "CEA01EG822":"KKS: CEA01EG822\nTEXT: 0.4kV BOARD BFA06\nSTATUS: DIST\nREASON: Over-current protection in one of the breaker modules of BFA06 has actuated (white disturbance lamp on)\nACTION: Check which MCB has tripped. Investigate reason for over-current protection actuation. After elimination of fault, reset over-current relay",
    "CEA01EG823":"KKS: CEA01EG823\nTEXT: 0.4kV BOARD BFA06\nSTATUS: LCINT\nREASON: One of the breaker modules is racked out or in test position\nACTION: Return breaker module to operating position",
    "CHA00EE231":"KKS: CHA00EE231\nTEXT: OVERFLUX\nSTATUS: ALARM\nREASON: Over-excitation alarm has been activated(Alarm only)\nACTION: Contact protection department and / or ABB",
    "CHA00EG801":"KKS: CHA00EG801\nTEXT: GEN PROT RELAY\nSTATUS: TEST\nREASON: One or both of the key switches is in test position\nACTION: If no testing is ongoing switch keys back to normal position",
    "CHA00EG803":"KKS: CHA00EG803\nTEXT: GEN PROT CUBICLE\nSTATUS: FAILR\nREASON: Summary alarm\nACTION: Check supply voltages of the protection panel. Check LED's 05, 06, and 07 on Prot. Group A, print 216DB61 for failure of MCB's in measuring / supply circuits (PT and Rotor Earth Fault supervision). Check LED's 01 and 02 on both Prot. Groups, print 216AB61 (illuminated for no disturbnace)",
    "CHA00EU151":"KKS: CHA00EU151\nTEXT: EMERG PUSHB GEN PROT\nSTATUS: ACTIV\nREASON: Generator protection system feedback of trip activated by push-button 'Generator Emergency Off' from opeartion panel\nACTION: Check reason for manual trip",
    "CHA00EU151":"KKS: CHA00EU151\nTEXT: GEN TRANSF PROTECTION\nSTATUS: ACTIV\nREASON: Collective alarm from the protection cuble indicating a tripping from protection function\nACTION: Find out which protection function has been activated, contact protection department and / or ABB",
    "CHA00EU153":"KKS: CHA00EU153\nTEXT: GEN PROTECTION CH 1\nSTATUS: ACTIV\nREASON: Channel 1 of generator protection has activated\nACTION: Contact protection department and / or ABB",
    "CHA00EU153R":"KKS: CHA00EU153R\nTEXT: GEN PROTECTION CH 2\nSTATUS: ACTIV\nREASON: Channel 2 of generator protection has activated\nACTION: Contact protection department and / or ABB",
    "CHA00EW111":"KKS: CHA00EW111\nTEXT: OVER-CURR UNIT AUX TRANSF\nSTATUS: ACTIV\nREASON: Over-current protection of the unit auxiliary transformer has activated.(Orders: line (grid) breaker open, gen. breaker open, field breaker open, unit trip, unit aux. breaker open and starting main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW141":"KKS: CHA00EW141\nTEXT: UNBALANC LOAD STEP 1\nSTATUS: ACTIV\nREASON: Negative phase sequences step 1 protection function has activated(ALARM only)\nACTION: Contact protection department and / or ABB",
    "CHA00EW141":"KKS: CHA00EW141\nTEXT: UNBALANC LOAD STEP 2\nSTATUS: ACTIV\nREASON: Negative phase sequences step 2 protection function has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and strating main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW151":"KKS: CHA00EW151\nTEXT: GEN DIFFERENTIAL\nSTATUS: ACTIV\nREASON: Generatore differential current protection has activated.(Orders: gen. circuit breaker open, field breaker open and unit trip)\nACTION: Contact protection department and / or ABB",
    "CHA00EW161":"KKS: CHA00EW161\nTEXT: UNIT AUX TRANSF DIFF\nSTATUS: ACTIV\nREASON: Unit auxiliary transformer differential current protection has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and strating main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW171":"KKS: CHA00EW171\nTEXT: GEN TRANSFORMER DIFF\nSTATUS: ACTIV\nREASON: Generator transformer current differential protection has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and strating main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW211":"KKS: CHA00EW211\nTEXT: OVER_VOLTAGE\nSTATUS: ACTIV\nREASON: Over-voltage protection has activated.(Orders:gen. breaker open, field breaker open and unit trip)\nACTION: Contact protection department and / or ABB",
    "CHA00EW231":"KKS: CHA00EW231\nTEXT: OVERFLUX\nSTATUS: ACTIV\nREASON: Over-excitation protection has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and strating main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW351":"KKS: CHA00EW351\nTEXT: OVERCURRENT/UNDERVOLTAGE\nSTATUS: ACTIV\nREASON: Over-curent/under-voltage protection has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and starting main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW361":"KKS: CHA00EW361\nTEXT: MIN. IMPEDANCE\nSTATUS: ACTIV\nREASON: Generator minimum impedance protection has activated.(Orders: line(grid) breaker open, gen.breaker open, field breaker open, unit trip, unit aux. breaker open and starting main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW371":"KKS: CHA00EW371\nTEXT: LOSS OF EXCITATION\nSTATUS: ACTIV\nREASON: Loss of excitation protection has activated.(Orders: gen.breaker open, field breaker open, and unit trip)\nACTION: Contact protection department and / or ABB",
    "CHA00EW511":"KKS: CHA00EW511\nTEXT: UNDER-FREQUENCY 1\nSTATUS: ACTIV\nREASON: Under frequency protection st. 1 has activated. Generation frequency is below 48 Hz for more than 0.5 sec.(Orders: line(grid) circuit breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW511":"KKS: CHA00EW511\nTEXT: UNDER-FREQUENCY 2\nSTATUS: ACTIV\nREASON: Under frequency protection st. 2 has activated. Generation frequency is below 47 Hz for more than 0.5 sec.(Orders: line(grid) circuit breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW622":"KKS: CHA00EW622\nTEXT: STARTING EARTH FAULT\nSTATUS: ACTIV\nREASON: Starting earth fault protection has activated.(Orders:line(grid) breaker open, gen. breaker open, field breaker open, unit trip, unit aux. breaker open and starting main breaker open)\nACTION: Contact protection department and / or ABB",
    "CHA00EW621":"KKS: CHA00EW621\nTEXT: GEN ROTOR EARTH FAULT\nSTATUS: ACTIV\nREASON: Generator rotor earth fault protection has activated.(Orders: gen. breaker open, field breaker open and unit trip)\nACTION: Contact protection department and / or ABB",
    "CHA00EW631":"KKS: CHA00EW631\nTEXT: GEN STATOR EARTH FAULT\nSTATUS: ACTIV\nREASON: Generator stator earth fault protection has activated.(Orders: gen. breaker open, field breaker open and unit trip)\nACTION: Contact protection department and / or ABB",
    "CJP00EA100":"KKS: CJP00EA100\nTEXT: FG GT AUTO PROGRAM\nSTATUS: SMZ\nREASON: One or more permissives are not satisfied within the tolerance time\nACTION: Check which step-up criteria is missing (can be seen on POS) and rectify problem",
    "CJP00EA100":"KKS: CJP00EA100\nTEXT: FUEL GAS PRESSURE\nSTATUS: > MAX\nREASON: Gas pressure before gas control valve is greater than 27.6 bar with gas trip valve, MBP31AA003, not closed and the generator breaker open.\nACTION: Contact ARCO. Do not attempt re-start until supply pressure has been normalized",
    "CJQ00EA801":"KKS: CJQ00EA801\nTEXT: COLD AIR TEMP GEN\nSTATUS: WRONG\nREASON: Generator cooling air temperature is either higher than 70deg C or less than 15deg C\nACTION: Check that both generator cooling fans are running. Check cleanliness of generator cooling water coolers. Ensure all water isolating valves at generator cooler inlet and outlet are open. If unit is at standstill ensure standstill heaters are in service",
    "CJQ00EA802":"KKS: CJQ00EA802\nTEXT: WARM AIR TEMP GEN\nSTATUS: > HIGH\nREASON: Either one or both of the temperature measuring probes MKA13CT012 / 022 indicate a temperature higher than 115deg C for more than 65 seconds\nACTION: Check that both generator cooling fans are running. Check cleanliness of generator cooling water coolers. Check that all water isolating valves at generator cooler inlet and outlet are open. Reduce reactive power back to zero",
    "CJQ00EA803":"KKS: CJQ00EA803\nTEXT: CW PRESS BEF PUMP\nSTATUS: < MIN\nREASON: Pressure in generator cooling water system, before circulation pumps, is less than 0.6 bar for more than 3 seconds\nACTION: Check for water leaks. Refill system with de-min. water if required (for pressure, refer to final settings)",
    "CJQ00EA804":"KKS: CJQ00EA804\nTEXT: CW PRESS AFT GEN\nSTATUS: < MIN\nREASON: Pressure in generator cooling water system, after generator, is less than 1.3 bar for more than 3 seconds. This will cause the cooling water pump to trip after 8 seconds.\nACTION: Check for water leaks. Refill system with de-min. water if required (for pressure, refer to final settings)",
    "CJQ00EA805":"KKS: CJQ00EA805\nTEXT: WARM AIR TEMP GEN\nSTATUS: > MAX\nREASON: Both of the temperature probes MKA13CT013 / 023 indicate a temperature higher than 125deg C\nACTION: Check that both generator cooling fans are running. Check all cleanliness of generator cooling water coolers. Check that all water isolating valves at generator cooler inlet and outlet are open",
    "CJQ00EA806":"KKS: CJQ00EA806\nTEXT: BLEED VALVES\nSTATUS: N. CLOSED\nREASON: One or more of the bleed valves are not closed with the unit at nominal operational speed\nACTION: Check air supply pressures for bleed valves on gauges MBX69CP001-CP003. Readjust if necessary (refer to final settings for values). Check air supply lines to bleed valves for leaks. Check air filters MBC69AT002 and AT003 for cleanliness. If the bleed valves are actually closed ( can be heard by an exprienced operator at the bleed valve silencer), check limit switches of faulty bleed valve during next shut down",
    "CTA00EG801":"KKS: CTA00EG801\nTEXT: VOLT TRANSF MCB\nSTATUS: TRIP\nREASON: One or more MCB's of a voltage transformer (PT) in generator breaker module tripped\nACTION: Check MCB's Q221, Q222, Q223, Q224, Q225, Q231, Q232, Q233, Q234. Investigate reason for MCB tripping and reset",
    "CXQ10EG801":"KKS: CXQ10EG801\nTEXT: GT ENCLOSURE FANS\nSTATUS: FAULT\nREASON: One or more of the fanpower supply MCB's has tripped\nACTION: Locale tripped MCB in ventilation and lighting panel, locale inside generator enclosure. Ascertain cause of trip and reset after rectifying fault",
    "CYE10EG001":"KKS: CYE10EG001\nTEXT: FIRE ALARM\nSTATUS: ACTIV\nREASON: One of the fire emergency channel's has been actuated\nACTION: Investigate reason for the emergency tri actuation. Reset fire emergency trip pushbutton with release key. Reset fire protection trip",
    "CYE10EG801":"KKS: CYE10EG801\nTEXT: FIRE DETEC SYSTEM\nSTATUS: FAULT\nREASON: Common disturbance message from the fire fighting cubicle\nACTION: Determine the reason for the defect, by checking the fire fighting panel, and eliminate the disturbance",
    "CYE10EG901":"KKS: CYE10EG901\nTEXT: FIRE ALARM GT MODULE\nSTATUS: ACTIV\nREASON: Fire detection line for GT module activated\nACTION: Check locally at GT Module for fire. Reset alarm at the fire control panel if there is no fire, check reason for false alarm",
    "CYE10EG916":"KKS: CYE10EG916\nTEXT: FIRE ALARM ENCLOSURE\nSTATUS: ACTIV\nREASON: Fire detection linefor enclosure activated\nACTION: Check locally at GT enclosure for fire. Reset alarm at the fire control panel if there is no fire, check reason for false alarm",
    "CYE10EG917":"KKS: CYE10EG917\nTEXT: FIRE ALARM HENRY MODULE\nSTATUS: ACTIV\nREASON: Fire detection line for Henry Module activated\nACTION: Check locally at GT Henry Module for fire. Reset alarm at the fire control panel if there is no fire, check reason for false alarm",
    "EGC00EB100":"KKS: EGC00EB100\nTEXT: FUEL FORWARD SYSTEM\nSTATUS: FAULT\nREASON: Collective alarm from the fuel forwarding system\nACTION: Check at the local control panel for the forwarding system wether: Local/remote switch is in position Local. Supply supervision (under-voltage) has activated. One or more pump motor over-current protections has activated. Ground fault detection has activated",
    "EGD30CP001":"KKS: EGD30CP001\nTEXT: DP FUEL FORW FILTER\nSTATUS: > HIGH\nREASON: Differential pressure across fuel oil forwarding filter is too high\nACTION: Change over to stand-by fuel oil filter and clean the dirty filter",
    "HYY00EY901":"KKS: HYY00EY901\nTEXT: BOILER PROTECTION CH1\nSTATUS: ACTIV\nREASON: Trip signal from the boiler protection. Causes unload protection of gas turbine until divertor is closed. If unit trips: divertor failed to close within 120seconds.\nACTION: Consult steam plant operatives. Investigate reason why divertor failed to close within allowed time",
    "MBA30CP025":"KKS: MBA30CP025\nTEXT: EXH GAS PRESS\nSTATUS: > HIGH\nREASON: Pressure in exhaust duct is higher than 50 mbar\nACTION: Check position of exhaust diveror flaps. Check position of boiler stack weather damper. Check that condensate trap is not full of water",
    "MBA30CP026":"KKS: MBA30CP026\nTEXT: EXH GAS PRESS CH1 MAX\nSTATUS: TRIP\nREASON: Pressure in exhaust duct is higher than 60 mbar(channel 1 activated)\nACTION: Check position of exhaust diveror flaps. Check position of boiler stack weather damper. Check that condensate trap is not full of water",
    "MBA30CP026R":"KKS: MBA30CP026R\nTEXT: EXH GAS PRESS CH2 MAX\nSTATUS: TRIP\nREASON: Pressure in exhaust duct is higher than 60 mbar(channel 2 activated)\nACTION: Check position of exhaust diveror flaps. Check position of boiler stack weather damper. Check that condensate trap is not full of water",
    "MBA30CS001":"KKS: MBA30CS001\nTEXT: OVERSPEED CHA > 110%\nSTATUS: ACTIV\nREASON: Over-speed trip 110% activated(electrical)\nACTION: Determine reason for over-speed",
    "MBA30CS002":"KKS: MBA30CS002\nTEXT: OVERSPEED CHB > 110%\nSTATUS: ACTIV\nREASON: Over-speed trip 110% activated(electrical)\nACTION: Determine reason for over-speed",
    "MBA30CS003":"KKS: MBA30CS003\nTEXT: OVERSPEED CHC > 110%\nSTATUS: ACTIV\nREASON: Over-speed trip 110% activated(electrical)\nACTION: Determine reason for over-speed",
    "MBA31AA002":"KKS: MBA31AA002\nTEXT: F LIQ DRAIN VLV POS\nSTATUS: N. CLOSED\nREASON: 3-way valve is in 'wash' or indeterminate position. Limit switch disturbed\nACTION: Return valve to 'operation' position. Check holder of limit switch. Check function / adjustment of limit switch",
    "MBA80CP901":"KKS: MBA80CP901\nTEXT: PRESS AFT COMPRESSOR\nSTATUS: FAULT\nREASON: Channel difference between channels 1 and 2 of compressor delivery pressure is higher than 3%\nACTION: Measure compressor delivery pressures. Check calibration of transmitters MBA80CP011 and MBA30CP012",
    "MBA80CT005":"KKS: MBA80CT005\nTEXT: SEAL-AIR TEMPERATURE\nSTATUS: > HIGH\nREASON: Seal air rotor front face, compressor side, is higher than 375deg C\nACTION: Deload unit, at least until alarm clears. Contact ABB",
    "MBA82DA800":"KKS: MBA82DA800\nTEXT: GUIDE-BLADE RELEASE\nSTATUS: FAULT\nREASON: Pressure for linear amplifier is insufficient at less than 60 bar\nACTION: Check pressure at solenoid valve. Check solenoid valve opens. Check for leakages",
    "MBA82DA800":"KKS: MBA82DA800\nTEXT: GUIDE-BLADE POSITION\nSTATUS: FAULT\nREASON: Deviation between set-point for VIGV and actual position measurement is too high\nACTION: Adjust the set-point back to the actual position and reset. Attempt local / manual opeartion of VIGV to determine zone of fault. (only experienced personnel are to perform this task)",
    "MBA82CG902":"KKS: MBA82CG902\nTEXT: GUIDE-BLADE MEAS CH DIFF\nSTATUS: ACTIV\nREASON: Deviation between the angle measurement from two transmitters is too high\nACTION: Check angle transmitters and recalibrate if necessary",
    "MBA83EA801":"KKS: MBA83EA801\nTEXT: CLEANING\nSTATUS: FAULT\nREASON: Essential criterias for cleaning are not fulfilled\nACTION: Check all blow-off valves are closed. Check FG fuel liquid supply and FG fuel gas supply are switched off. Check FG combustion chamber is switched off. Check VIGV is 'open'. Check that exhaust gas tract is 'open'",
    "MBD10CY001":"KKS: MBD10CY001\nTEXT: BEARING VIBR TURB VERT\nSTATUS: > HIGH\nREASON: Vibrations at turbine bearing, in vertical plane, are higher than 8mm/s\nACTION: Verify reading by cross check/calibration. Contact ABB",
    "MBD10CY002":"KKS: MBD10CY002\nTEXT: BEARING VIBR TURB HORIZ\nSTATUS: > HIGH\nREASON: Vibrations at turbine bearing, in horizontal plane, are higher than 8mm/s\nACTION: Verify reading by cross check/calibration. Contact ABB",
    "MBD20CY001":"KKS: MBD20CY001\nTEXT: BEARING VIBR COMPR VERT\nSTATUS: > HIGH\nREASON: Vibrations at compressor bearing, in vertical plane, are higher than 8mm/s\nACTION: Verify reading by cross check/calibration. Contact ABB",
    "MBD20CY002":"KKS: MBD20CY002\nTEXT: BERAING VIBR COMPR HORIZ\nSTATUS: > HIGH\nREASON: Vibrations at compressor bearing, in horizontal plane, are higher than 8mm/s\nACTION: Verify reading by cross check/calibration. Contact ABB",
    "MBH00EA803":"KKS: MBH00EA803\nTEXT: COOL AIR VALVES POS\nSTATUS: WRONG\nREASON: Valves on top of combustion chamber are not in corect position after 10 seconds from flame ON (igintion)\nACTION: Check that valves MBN35AA001 and MBH41AA010 are in 'OPEN' position during gas operation and 'CLOSED' during liquid or dual operation. Check position of MBN32AA002 and MBN32005. Check lmit swiches. Check pilot solenoid valves for these valves",
    "MBH33CT001":"KKS: MBH33CT001\nTEXT: COOL-AIR TEMP ROT\nSTATUS: > HIGH\nREASON: Rotor cooling air temperature is higher than 330deg C\nACTION: Check that both rotor air coolers are running. Check cleanliness of rotor air cooler",
    "MBH33CT001":"KKS: MBH33CT001\nTEXT: COOL-AIR ROT UNLOAD\nSTATUS: ACTIV\nREASON: Rotor cooling air temperature is higher than 350deg C\nACTION: Check that both rotor air coolers are running. Check cleanliness of rotor air cooler",
    "MBK70EA801":"KKS: MBK70EA801\nTEXT: ROTOR TURNING\nSTATUS: FAIL\nREASON: Stroke cylinder has not moved rotor within 60seconds\nACTION: Check the function of solenoid valve MBX51AA001. Check pressure after solenoid valve ( should be in accordance with Final Settings)",
    "MBK70EA802":"KKS: MBK70EA802\nTEXT: ROTOR TURNING\nSTATUS: FAULT\nREASON: The breaker module/MCC for one of the rotor barring pumps is not in service position. Over-current protection for one of the rotor barring pumps has been actuated. Level in hp power oil tank is low. Differential pressure across filter is high. Hp power oil pressure is below 30bar with either main or emergency pump in service for more than 5 seconds\nACTION: Put module MCC in service position. Investigate reason for over-current protection actuation and reset. Refill rotor barring oil tank with oil. Clean or replace filter element. Investigate cause of low pressure (see Final Settings for nominal pressure)",
    "MBK70EA804":"KKS: MBK70EA804\nTEXT: ROTOR TURNING\nSTATUS: N. AUTO\nREASON: Rotor barring has been switched off after TAT has dropped below 60deg C. Key selector switch at local control box (located above hp oil tank) is not set to 'AUTO' position\nACTION: Switch key selector switch back to AUTO position",
    "MBK70EA805":"KKS: MBK70EA805\nTEXT: HP-POW-O RES PUMP\nSTATUS: IN OP\nREASON: Rotor barring reserve pump (dc driven) in operation\nACTION: Investigate reason for rotor barring main pump (ac driven) failure. After rectifying fault switch back from reserve to main pump (refer to operating instructions for procedure)",
    "MBK90CY001":"KKS: MBK90CY001\nTEXT: VIBR BRG GEN NDE2 VERT\nSTATUS: > HIGH\nREASON: Vibrations at bearing NDE2, in vertical plane, are higher than 8 mm/s\nACTION: Verify reading by cross check/calibration. Contact ABB",
    "MBK90CY002":"KKS: MBK90CY002\nTEXT: VIBR BRG GEN NDE2 HORIZ\nSTATUS: > HIGH\nREASON: Vibrations at bearing NDE2, in horizontal plane, are higher than 8 mm/s\nACTION: Verify readnig by cross check/calibration. Contact ABB",
    "MBL30AT001":"KKS: MBL30AT001\nTEXT: PULSE FILTER-POWER SUPPLY\nSTATUS: FAULT\nREASON: Power supply to filter pulse cleaning control system has failed\nACTION: Check supply fuses at BFA07G01. Determine cause of failure and rectify. Replace fuses as required",
    "MBL30CP002":"KKS: MBL30CP002\nTEXT: DP AIR INT FILTER\nSTATUS: > HIGH\nREASON: Differential pressure over air intake filters is higher than 150mmWg\nACTION: Check cleanliness of filters. Verify justification of alarm with local idicator MBL30CP001. Check that pulse cleaning system is in operation",
    "MBL30CP003":"KKS: MBL30CP003\nTEXT: DP AIR INT FILTER\nSTATUS: > H.HIGH\nREASON: Differential pressure over air intake filters is higher than 190mmWg\nACTION: Check cleanliness of filters. Verify justification of alarm with local idicator MBL30CP001. Check that pulse cleaning system is in operation",
    "MBL30CP011":"KKS: MBL30CP011\nTEXT: VACUUM AIR INTAKE CH1\nSTATUS: < MIN\nREASON: Vacuum in air inlet duct is greater than 30 mbar\nACTION: Check air inlet filters for cleanliness. If air inlet filter are clean recheck setting of pressure switch",
    "MBL30CP011R":"KKS: MBL30CP011R\nTEXT: VACUUM AIR INTAKE CH2\nSTATUS: < MIN\nREASON: Vacuum in air inlet duct is greater than 30 mbar\nACTION: Check air inlet filters for cleanliness. If air inlet filter are clean recheck setting of pressure switch",
    "MBL30CP020":"KKS: MBL30CP020\nTEXT: PULSE COMPR PRESSURE\nSTATUS: < LOW\nREASON: Pressure available for filter pulse cleaning is less than 4.1 bar\nACTION: Check that compressor is available. Check position of hand valves in the system. Check for leakages in supply, distribution and manifold piping systems",
    "MBL30EG003":"KKS: MBL30EG003\nTEXT: IMPLOSION DOORS\nSTATUS: OPEN\nREASON: One or more of the implosion doors are open\nACTION: Check at filterhouse if implosion doors are closed. If doors are closed check, during next standstill, the limit switches of all doors. Caution: Before leaving the filterhouse, make sure no foreign materials are left. Check filters at filterhouse for cleanliness. Check and record filter differential pressure",
    "MBM31EA800":"KKS: MBM31EA800\nTEXT: F LIQ CONTR VALVE POS\nSTATUS: WRONG\nREASON: Fuel oil control valve MBN32AA007 is not open to allow cooling air flow to nozzle\nACTION: Check permissive feed back signals from the fuel valves. Check output signal from control systems. Check behavior an calibration of ehc and servo motor",
    "MBN31CP001":"KKS: MBN31CP001\nTEXT: FUEL LIQ FUEL MEAS\nSTATUS: DISTURB\nREASON: Transmitter or module for fuel liquid flow measurement is disturbed\nACTION: Check the fuse on the module, check the transmitter",
    "MBN31CP002":"KKS: MBN31CP002\nTEXT: DP FUEL-LIQ FILTER\nSTATUS: > MAX\nREASON: Differential pressure over fuel oil filter is higher than 0.8 bar\nACTION: Change over to the stand-by fuel oil filter and clean the dirty one",
    "MBN32AA007":"KKS: MBN32AA007\nTEXT: POS CONTR. F LIQ\nSTATUS: FAULT\nREASON: Disturbance of position controller LT5410\nACTION: Reset the controller with the push-button on the front plate",
    "MBN35CL003":"KKS: MBN35CL003\nTEXT: FUEL-LIQ LEVEL\nSTATUS: > HIGH\nREASON: Level in fuel oil leakage tank high\nACTION: Check that breaker module of fuel oil leakage pump is in service position. Check that hand isolating valve after the fuel oil block is open. Verify operation of fuel oil leakage pump locally at the fuel oil block. If problem cannot be solved within a short time, the unit must be either shut down immediately or changed over to gas operation",
    "MBP31AA007":"KKS: MBP31AA007\nTEXT: POS CONTR F GAS\nSTATUS: FAULT\nREASON: Disturbance of position controller LT5410\nACTION: Reset the controller with the push-button on the front plate",
    "MBP31CL010":"KKS: MBP31CL010\nTEXT: LIQ. LEVEL - GAS SEPARATOR\nSTATUS: > HIGH\nREASON: Fluid in gas separator / filter, dirty side, is too high\nACTION: Shut down unit or operate on fuel oil. Isolate gas supply. Drain fluid from lower chamber. Note: Ensure drain valves are closed before recommencing gas operation",
    "MBP31CL011":"KKS: MBP31CL011\nTEXT: LIQ. LEVEL - GAS SEPARATOR\nSTATUS: > HIGH\nREASON: Fluid in gas separator / filter, dirty side, is too high\nACTION: Shut down unit or operate on fuel oil. Isolate gas supply. Drain fluid from lower chamber. Note: Ensure drain valves are closed before recommencing gas operation",
    "MBP31CP014":"KKS: MBP31CP014\nTEXT: DP GAS SEPARATOR\nSTATUS: > HIGH\nREASON: Differential pressure across separator / filter is higher than 0.8 bar\nACTION: Shut down unit or operate on fuel oil. Isolate gas supply. Open separator and clean or replace filter catridges. Note: Separator should be purged with nitrogen prior to opening",
    "MBQ30CP002":"KKS: MBQ30CP002\nTEXT: PROP-GAS PRESSURE\nSTATUS: < MIN\nREASON: Pressure of propane gas less than 1.3 bar\nACTION: Check that at propane bottle isolating valves are open. Check that propane pressure regulators are correctly adjusted. Replace empty propane gas bottle(s). Check for leakage at pipe connections",
    "MBV10CL001":"KKS: MBV10CL001\nTEXT: LUBE-OIL LEVEL\nSTATUS: < LOW\nREASON: Level of lube oil less than minimum\nACTION: Check oil system for oil leaks. Refill oil tank with turbine oil",
    "MBV10CL001":"KKS: MBV10CL001\nTEXT: LUBE-OIL LEVEL\nSTATUS: > HIGH\nREASON: Level of lube oil higher than maximum\nACTION: Drain lube oil until a normal oil level has been established",
    "MBV21CP002":"KKS: MBV21CP002\nTEXT: DP LUBE-OIL FILTER\nSTATUS: > MAX\nREASON: Differential pressure across lube oil filter higher than 0.6 bar\nACTION: Change over to stand-by lube oil filter and clean the dirty filter",
    "MBV21EA801":"KKS: MBV21EA801\nTEXT: LUBE-OIL TEMPERATURE\nSTATUS: < MIN\nREASON: Lube oil temperature in lube oil tank after filter is less than 18deg C (the later supervision is only active 600 seconds after n > 2700rpm)\nACTION: Check that lube oil storage tank heaters are in service. Check breaker modules of oil storage tank heaters MBV10AH001/002 for disturbances (i.e. overload protection). Check settings/operation of thermostats MBV10CT001/002. Check settings of temperature switches MBV10CT010 and MBV40CT002",
    "MBV21EA802":"KKS: MBV21EA802\nTEXT: LUBE OIL VAPOUR FAN\nSTATUS: FAULT\nREASON: Vapour fan No.1 not in service with lube oil pressure higher than 0.9 bar or emergency cooling pump in service (or) Vapour fan No 2 not in service with above conditions plus n > 700rpm\nACTION: Check that breaker modules of lube oil vapour fans are in service position. Check breaker modules of lube oil vapour fans for disturbances. If found, investigate reason for MCB tripping and rectify problem",
    "MBV21EA803":"KKS: MBV21EA803\nTEXT: EMERG COOL OIL PUMP\nSTATUS: FAULT\nREASON: Contactor K10 in panel +BUA02B is not energized within 1 second of receiving an automatic 'ON' order for emergency cooling oil pump\nACTION: Check if relay K10 in panel +BUA02B is activated. If not, check with voltmeter at terminals X10 11/13 if signal is available. Check if contact 22/ 21 of relay K10 is closed. If yes, check if signal is present on P14 bus. If not check wiring of circuit for continuity",
    "MBV21EA804":"KKS: MBV21EA804\nTEXT: EMERG COOL OIL PUMP\nSTATUS: ON\nREASON: Emergency cooling pump is in service\nACTION: Note : Indication only. Observe accompanying messages for reason as to why pump is required",
    "MBV22AP001":"KKS: MBV22AP001\nTEXT: EMERG COOL OIL PUMP\nSTATUS: FAILR\nREASON: 220 Vdc supply voltage for emergency cooling oil pump is disturbed\nACTION: Check if MCB Q1 in panel +BUA02B is closed. If necessary, investigate reason for MCB tripping and reset. Check incoming 220Vdc voltage is not available, check batteries and battery charger",
    "MBV22AP001":"KKS: MBV22AP001\nTEXT: EMERG COOL OIL PUMP\nSTATUS: OVERL\nREASON: Thermal protection for motor activated. Current consumption of emergency cooling oil pump motor too high\nACTION: Check pressure after cooling oil pump. Check/measure current consumption",
    "MBV40CT002":"KKS: MBV40CT002\nTEXT: LUBE-OIL TEMPERATURE\nSTATUS: > HIGH\nREASON: Temperature of lube oil after lube oil filter hihgher than 65deg C(MBV40CT002)\nACTION: Check that all lube oil cooling fans are in operation. If not, clear rason for malfunctioning. Check that by-pass valves are in correct position. Check lube oil coolers are clean. If necessary clean coolers. Check setting of lube  oil temperature switch MBV40CT002. Verify that Amot valve is passing oil to coolers",
    "MBV70CL001":"KKS: MBV70CL001\nTEXT: LEVEL REL LUBE OIL\nSTATUS: > HIGH\nREASON: Level in lube oil tank MBV70BB001 is too high\nACTION: Check that power oil and lube oil filter drains and vents are closed. Check that pressuer switch MBV50CP012 drain is closed. Pump out tank with hand pump",
    "MBX00EW201":"KKS: MBX00EW201\nTEXT: TURB TRIP MANUAL\nSTATUS: ACTIV\nREASON: Emergency push-button on either local or remote operators console has been actuated\nACTION: ",
    "MBX00EW201":"KKS: MBX00EW201\nTEXT: BRG VIBRAT VERT TRIP\nSTATUS: ACTIV\nREASON: Collective trip signal. One or more vibration pickups in vertical plane registers higher than 15mm/s\nACTION: Refer to accompanying trip and alarm messages. Contact ABB",
    "MBX00EW201":"KKS: MBX00EW201\nTEXT: BRG VIBRAT HORIZ\nSTATUS: > MAX\nREASON: Collective trip signal. One or more vibration pickups in horizontal plane registers higher than 15mm/s\nACTION: Refer to accompanying trip and alarm messages. Contact ABB",
    "MBX00EW201":"KKS: MBX00EW201\nTEXT: FIRE PROTECTION\nSTATUS: ACTIV\nREASON: Emergency fire protection push button on either local or remote operators console or in unit enclosure has been activated\nACTION: Reset with key-switch in unit enclosure, if applicable. Reset fire protection trip",
    "MBX00EW202":"KKS: MBX00EW202\nTEXT: 2V3 OVERSPEED 110% TRIP\nSTATUS: ACTIV\nREASON: Two of three over-speed channels have activated\nACTION: Determine reason for over-speed",
    "MBX00EW203":"KKS: MBX00EW203\nTEXT: FLAME MONIT CH DIFF\nSTATUS: ACTIV\nREASON: 1 out of 3 Fireyes does not detect flame\nACTION: Check that all shutters to flame monitors are open. Remove the corresponding flame detectors and check its function by using a flash light. Check cleanliness of flame detector sight glass",
    "MBX00EW203":"KKS: MBX00EW203\nTEXT: FLAME OFF TRIP\nSTATUS: ACTIV\nREASON: 2 out of 3 fireyes do not detect flame\nACTION: Check that all shutters to flame monitors are open. Remove the corresponding flame detectors and check its function by using a flash light. Check cleanliness of flame detector sight glasses. Check fuel sytems for any irregularities",
    "MBX00EW850":"KKS: MBX00EW850\nTEXT: SV TO EMG OIL WIRE\nSTATUS: BROKE\nREASON: Wiring for either solenoid valve MBX62AA010(ch1) or MBX41AA030(ch2) is faulty\nACTION: Check continuity of wiring for both solenoid valves",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: ACCELERATION\nSTATUS: < LOW\nREASON: Acceleration supervision first stage actuated(during start-up)\nACTION: Check if positioning controller LT5410 is reset (red LED on front panel must be illuminated). If necessary reset LT5410 with push-button on ftont panel, but ONLY AFTER SHUT-DWON! Check the two plugs at the electro-hydraulic converter, located in oil regulating panel, are fitted and secure. Check internal fuse in LT5410. If necessary, investigate reason for disturbance and replace fuse",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: T TURB INL > MAX TRIP CH1\nSTATUS: ACTIV\nREASON: Turbine inlet temperature is higher than 1130deg C(channel 1 actuation)\nACTION: If trip occurred during fuel change over, check adjustment of fuel control valves ( for values refer to Final Settings) Check measurement/calibaration of exhaust gas temperature and pressure, compressor discharge pressure and ambient pressure",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: T TURB INL > HIGH UNLOAD\nSTATUS: ACTIV\nREASON: Turbine inlet temperature is higher than 1120deg C\nACTION: Reduce set point of TIT controller. Check that are no fast pressure changes in the fuel supply systems. If deloading occurred during fuel change over, check adjustment of fuel control valves (for values refer to Final Settings). Check measurement/calibration of exhaust gas temperature and pressure, compressor discharge pressure and ambient pressure",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: T EXH GAS > MAX TRIP CH 1\nSTATUS: ACTIV\nREASON: Exhaust gas temperature is higher than 575deg C(channel 1 actuation)\nACTION: If trip occurred during fuel change over, check adjustment of fuel control valves ( for values refer to Final Settings) Check measurement/calibaration of exhaust gas temperature and pressure, compressor discharge pressure and ambient pressure",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: T EXH GAS > HIGH UNLOAD\nSTATUS: ACTIV\nREASON: Exhaust gas temperature is higher than 565deg C\nACTION: Reduce set point of TIT controller. Check that are no fast pressure changes in the fuel supply systems. If deloading occurred during fuel change over, check adjustment of fuel control valves (for values refer to Final Settings). Check measurement/calibrat",
    "MBX01EW201":"KKS: MBX01EW201\nTEXT: DP/PK2 SHAFT COOL\nSTATUS: > MAX\nREASON: Supervision of rotor cooling air flow\nACTION: Check all instrument lines for leakage. Check calibration of transmitter MBH33CP008. Contact ABB",
    "MBX01EW210":"KKS: MBX01EW210\nTEXT: BLD-VV NOT OPN TRIP\nSTATUS: ACTIV\nREASON: One or more of stage 1 pr stage 2 bleed valves is not open with GT speed lower than 2670rpm plus 20seconds or stage 3 bleed valve is not open with GT speed lower than 2790rpm plus 25seconds\nACTION: Ensure that temporary air supply from compressor wash trolly has been disconnected after washing of the of the compressor, especially the adpator piece for the air hosel. If signal persists after run-down, open manhole in bleed valve silencer. Check function of limit switches and check continuity of wiring",
    "MBX01EW210":"KKS: MBX01EW210\nTEXT: P-CTR OIL > MAX TRIP\nSTATUS: ACTIV\nREASON: Pressure in control oil system during strat-up is higher than 7.0 bar(Supervision disarms at n > 2700rpm)\nACTION: Check settings of pressure switch MBX43CP001 (oil operation) or MBX45CP001 (gas operation). Values can be found in the Final Settings report. Check adjustment of relevant fuel control valve (refer to final setting report for characteristics)",
    "MBX01EW210":"KKS: MBX01EW210\nTEXT: ACCELERATION < MIN TRIP\nSTATUS: ACTIV\nREASON: Acceleration supervision sedcond stage actuated(during start-up)\nACTION: Check if positioning controller LT5410 is reset (red LED on front panel must be illuminated). If necessary reset LT5410 with push-button on ftont panel. Check that the two plugs at the electro-hydraulic converter, located in oil regulating panel, are fitted and secure. Check internal fuse in LT5410. If necessary, investigate reason for disturbance and replace fuse",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: P-LIQ < MIN TRIP CH1\nSTATUS: ACTIV\nREASON: Fuel oil pressure after fuel oil pump is less than 55 bar with fuel liquid release valve,MBN32AA002, not closed for 2 seconds(channel 1 actuation)\nACTION: Check that all fuel system valves are in correct position.Check function of fuel oil pump. If necessary, investigates reason for MCB tripping and reset. Check fuel forwarding is in service if alarm combined wih alarm MBY00EA802. If unit is operating on gas, check position and lmit switches of fuel oil release valve MBN32AA002",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: HYD TURB PROT CH1(control ch1, not hydraulic)\nSTATUS: ACTIV\nREASON: Emergency stop push-button MBX62AA001 in oil regulating panel has been actuated (or) Over-speed trip device (112%) has been released (or) P.V. MBX62AA010,MBX41AA030 or MBX41AA031+AA032 has activated (or) Emergency oil pressure has fallen and allowed MBX41AA010 to release (or) Central power oil pressure is less than 25bar\nACTION: Investigates reason for emergency stop push-button actuation and solve problem. Check setting of over-speed trip device(for procedure refer to operating instructions). Investigate reason for P.V. actuation. Investigate reason for failing pressure, e.g. leakage(internal or external)",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: P-GAS < MIN TRIP CH1\nSTATUS: ACTIV\nREASON: Gas pressure before gas control valve is less than 19.0 bar with gas trip valve MBP31AA003 not closed for 2 seconds (channel 1 actuation)\nACTION: Check ARCO atation status. Check positions of all valves in fuel gas system are correct if alarm is combined with MBY00EA804. Check cleanliness of strainer MBP31AT001 if alarm is not combined with alarm MBY00EA804. Check calibration of pressure switch MBP31CP004 (refer to Final Settings for values). If unit is operating on oil, check position and limit switches of gas trip valve MBP31AA003",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: GT CONTROLLER TRIP\nSTATUS: ACTIV\nREASON: Internal supervision of modules used for GT controlling has been activated\nACTION: Refer to P14 system description to find out which module is disturbed and rectify. Cocntact ABB",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: P LUBE OIL < MIN UNLOAD\nSTATUS: ACTIV\nREASON: Lube oil pressure is less than 0.9 abr (MBV40CP002) with GT speed higher than 66rpm\nACTION: Check that oil level in lube oil tank is above alarm level. Check adjustment of constant pressure valve MBV21DP002 (refer to final settings for values). Check calibration of pressure switch MBV40CP002 (refer to Final Settings for values)",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: BRG TEMP > MAX TRIP CH1\nSTATUS: ACTIV\nREASON: The measured temperature on both channel 1 circuits of a particular bearing are in excess of their trip limit(see Final Settings for values)\nACTION: Check measuring circuits of corresponding bearing for continuity. Check oil flow to the corresponding bearing (oil flow can be seen through the sight glass in the lube oil return line with exception of the axial bearing). If there is no flow, check orifice in suply line. Check lube oil supply temperature. If temperature is toohigh, check function and cleanliness of lube oil coolers. Contact ABB",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: SPEED MONITOR 1V3\nSTATUS: FAULT\nREASON: One out of three speed transmitter/monitor systems is disturbed\nACTION: Check signaling loops from the speed pick-ups to LCR for continuity. Check that speed pick-ups are functioning. Trouble shoot transmitters and monitors in accordance with O&M manual module descriptions.",
    "MBX01EW211":"KKS: MBX01EW211\nTEXT: SPEED MONITOR 2V3 TRIP\nSTATUS: ACTIV\nREASON: Two out of three speed transmitter / monitor systems is disturbed\nACTION: Check signaling loops from the speed pick-ups to LCR for continuity. Check that speed pick-ups are functioning. Trouble shoot transmitters and monitors in accordance with O&M manual module descriptions.",
    "MBX01EW212":"KKS: MBX01EW212\nTEXT: UNLOAD PROTECTION\nSTATUS: ACTIV\nREASON: TAT higher than 565deg C, TIThigher than 1120degC, Rotor cool air temperature higher than 350deg C, Lube oil pressure less than 0.9 bar, Boiler protection activated, Note: Unload protection due to lube oil pressure less than 0.9 bar will automatically deload until unit is off grid, followed by a turbine trip. Reset is not possible\nACTION: Check, which signal has caused the unloading protection. Check exhaust gas measurement. Check both compressor discharge pressure transmitters MBA80CP011 and MBA80CP012. Check rotor cooling air coolers are operating. Check pipework for leakage. Check lube oil pressure(oscillating, low value, dirty filters etc.)",
    "MBX01EW214":"KKS: MBX01EW214\nTEXT: CHANNEL DIFF MONIT CTRL\nSTATUS: ACTIV\nREASON: Failure of set-point tracking (or) Controller module damaged. Note: Change-over to back-up controller is blocked\nACTION: Contact ABB",
    "MBX01EW214":"KKS: MBX01EW214\nTEXT: BACK UP CONTROLLER\nSTATUS: DIST\nREASON: Back-up controller module is damaged (or) Set-point comparison / supervision activated\nACTION: Change control module, but utilize sam PROM. Checfk calibration of UA377 module. Contact ABB",
    "MBX01EW214":"KKS: MBX01EW214\nTEXT: TEMP LIMITER\nSTATUS: LEADS\nREASON: TAT is higher than 555deg C with back-up controller in operation. Note: Back-up controller has no dead band and grid instability reflects or unit\nACTION: Deload unit untill alarm clears",
    "MBX01EW214":"KKS: MBX01EW214\nTEXT: MAIN CONTROLLER\nSTATUS: DIST\nREASON: Module supervision of main controller activated\nACTION: Check signals of control module",
    "MBX01EW220a":"KKS: MBX01EW220a\nTEXT: GUIDE-BLADE POS CH1\nSTATUS: WRONG\nREASON: Guide-vane (VIGV) in position below 46deg with GT speed above 66rpm\nACTION: Check, visually, position of the VIGV. Check signals of both angle transmitters. MBA82CG001 and CG002 and if necessary recalibrate them",
    "MBX01EW800":"KKS: MBX01EW800\nTEXT: TURB PROTECTION\nSTATUS: ACTIV\nREASON: Trip channel 1 or 2 is activated\nACTION: Refer to accompanying trip message and eliminate cause of trip",
    "MBX01EW800":"KKS: MBX01EW800\nTEXT: TURB. PROT. CH1\nSTATUS: FAILR\nREASON: Collective alarm, turbine protection channel 1\nACTION: Check which transmitter is disturbed (for disturbance signals, refer to P14 system decription). Check modules at Decontic K part of any disturbances. Investigates reason for module disturbnace and solve problem. Check if ther is any disturbance signal coming from the generator breaker. If yes, investigate reason for disturbance in accordance with generator breaker wiring diagrams. Check that there is no disturbance signal from generator protection system (GSX) present. Check VIGV position is correct.",
    "MBX01EW801":"KKS: MBX01EW801\nTEXT: BRG TEMP TURBINE\nSTATUS: > HIGH\nREASON: Bearing temperature of turbine bearing, measured with thermocouple MBD11CT001 or MBD11CT002, is higher than  115deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check for oil flow in lube oil drain sight glass. If there is no flow, check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW802":"KKS: MBX01EW802\nTEXT: BRG TEMP COMPRESSOR\nSTATUS: > HIGH\nREASON: Bearing temperature of compressor bearing, measured with thermocouple MBD21CT001 or MBD21CT002, is higher than  115deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check for oil flow in lube oil drain sight glass. If there is no flow, check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW803":"KKS: MBX01EW803\nTEXT: BRG TEMP GEN DE\nSTATUS: > HIGH\nREASON: Bearing temperature of generator driven end bearing, measured with thermocouple MKD11CT001 or MKD11CT002, is higher than 105deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check for oil flow in lube oil drain sight glass. If there is no flow, check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW804":"KKS: MBX01EW804\nTEXT: BRG TEMP GEN NDE\nSTATUS: > HIGH\nREASON: Bearing tempearture of generator non  driven end bearing, measured with thermocouple MKD21CT001 or MKD21CT002,is higher than 95deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check for oil flow in lube oil drain sight glass. If there is no flow, check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW805":"KKS: MBX01EW805\nTEXT: TEMP COMP/GEN\nSTATUS: > HIGH\nREASON: Bearing temperature of thrust bearing measured with thermocouple MBDCT003 / 005 / 023 / 025, is higher than 95deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW806":"KKS: MBX01EW806\nTEXT: RADIAL BRG AUX GEAR\nSTATUS: > HIGH\nREASON: Bearing temperature of auxiliary gearbox (generator non driven end 2), measured with thermocouple MKD31CT001 or MKD31CT002 is higher than 95deg C\nACTION: Check lube oil temperature after lube oil filter if oil temperature is too high, check oil coolers for cleanliness. Check lube oil pressure after oil filter. If necessary, readjust oil pressure with constant pressure valve MBV21DP002. Check for oil flow in lube oil drain sight glass. If there is no flow, check supply line and flow restriction orifice before bearing. Contact ABB",
    "MBX01EW807":"KKS: MBX01EW807\nTEXT: T ROT FRONT FACE\nSTATUS: > HIGH\nREASON: Temperature of rotor cooling air, turbine side, is higher than 140deg C with speed higher than 2800rpm for more than 60seconds\nACTION: Check thermocouple and calibration of transmitter. Contact ABB",
    "MBX02EW201":"KKS: MBX02EW201\nTEXT: T EXH GAS > MAX TRIP CH2\nSTATUS: ACTIV\nREASON: Exhaust gas temperature is higher than 575deg C(channel 2 actuation)\nACTION: If trip occurred during fuel change over, check adjustment of fuel control valves (for values refer to Final Settings). Check measurement of exhaust gas temperature.",
    "MBX02EW201":"KKS: MBX02EW201\nTEXT: T TURB INL > MAX TRIP CH2\nSTATUS: ACTIV\nREASON: Turbine inlet temperature is higher than 1130deg C(channel 2 actuation)\nACTION: If trip occurred during fuel change over, check adjustment of fuel control valves (for values refer to Final Settings). Check measurement / calibration of exhaust gas temperature and pressure, compressor discharge pressure and ambient pressure",
    "MBX02EW211R":"KKS: MBX02EW211R\nTEXT: HYD TURB PROT CH2(control ch2, not hydraulic)\nSTATUS: ACTIV\nREASON: Emergency stop push-button MBX62AA001 in oil regulating panel has been actuated (or) Over-speed trip device (112%) has been released (or) P.V. MBX62AA010,MBX41AA030 or MBX41AA031+AA032 has activated (or) Emergency oil pressure has fallen and allowed MBX41AA010 to release (or) Central power oil pressure is less than 25 bar\nACTION: Investigate reason for emergency stop push-button actuation and solve problem. Check settings of over-speed trip devices (for procedure refer to operating instructions). Investigate reason for p.v. actuation. Investigate reason for failing pressure, e.g. leakage (internal or external)",
    "MBX02EW211R":"KKS: MBX02EW211R\nTEXT: BRG TEMP > MAX TRIP CH2\nSTATUS: ACTIV\nREASON: The measured temperature on both channel 2 circuits of a particular bearing are in excess of their trip limit(see Final Settings for values)\nACTION: Check measuring circuits of corresponding bearing for continuity. Check oil flow to the corresponding bearing (oil flow can be seen through the sight glass in the lube oil return line with exception of the axial bearing). If there is no flow, check orifice in supply line. Check lube oil supply temperature. If temperature is too high, check function and cleanliness of lube oil coolers. Contact ABB",
    "MBX02EW211R":"KKS: MBX02EW211R\nTEXT: P-GAS < MIN TRIP CH2\nSTATUS: ACTIV\nREASON: Gas pressure before gas control valve is less than 19.0 bar with gas trip valve MBP31AA003 not closed for 2 seconds (channel 1 actuation)\nACTION: Check ARCO atation status. Check positions of all valves in fuel gas system are correct if alarm is combined with MBY00EA804. Check cleanliness of strainer MBP31AT001 if alarm is not combined with alarm MBY00EA804. Check calibration of pressure switch MBP31CP004 (refer to Final Settings for values). If unit is operating on oil, check position and limit switches of gas trip valve MBP31AA003",
    "MBX02EW211R":"KKS: MBX02EW211R\nTEXT: P-LIQ < MIN TRIP CH2\nSTATUS: ACTIV\nREASON: Fuel oil pressure after fuel oil pump is less than 55 bar with fuel liquid release valve,MBN32AA002, not closed for 2 seconds(channel 1 actuation)\nACTION: Check that all fuel system valves are in correct position.Check function of fuel oil pump. If necessary, investigates reason for MCB tripping and reset. Check fuel forwarding is in service if alarm combined wih alarm MBY00EA802. If unit is operating on gas, check position and lmit switches of fuel oil release valve MBN32AA002",
    "MBX02EW220R":"KKS: MBX02EW220R\nTEXT: GUIDE-BLADE POS CH2\nSTATUS: WRONG\nREASON: Guide-vane (VIGV) in position below 46deg with GT speed above 66rpm\nACTION: Check, visually, position of the VIGV. Check signals of both angle transmitters. MBA82CG001 and CG002 and if necessary recalibrate them",
    "MBX02EW800R":"KKS: MBX02EW800R\nTEXT: TURB PROTECT CH2\nSTATUS: FAILR\nREASON: Collective alarm, turbine protection channel 2\nACTION: Check which transmitter is disturbed (for disturbance signals, refer to P14 system decription). Check VIGV position is correct",
    "MBX10EA801":"KKS: MBX10EA801\nTEXT: PROTECT CHANNEL 1/2\nSTATUS: FAULT\nREASON: Selected test sequence has failed to release pressure within channel under test(trip)\nACTION: Conduct full set of hydraulic tests on both channels, to determine common element involved in failed tests.(Use F.G. diagrams for assistance). Shut down unit and rectify defect",
    "MBX10EA802":"KKS: MBX10EA802\nTEXT: HYD TRIP VLV POS\nSTATUS: FAULT\nREASON: One of the test sides is in position TEST for longer than 4 minutes\nACTION: Check that all test sequences are OFF. Check function of PV test side MBX41AA002A/B. Shut-down unit and check PV MBX41AA002A/B for defect",
    "MBX10EA803":"KKS: MBX10EA803\nTEXT: RESET OVER-SPEED\nSTATUS: FAULT\nREASON: Over-speed reset pressure is higher than 0.8 bar for longer than 4 seconds with emergency oil pressure established\nACTION: Check pressure in system MBX63 with independent pressure gauge. Recalibrate switch if required. Check that electrical supply to solenoid valve MBX63AA001 is off(solenoid should be at ambient temperature). Check valve for leakage or blockage of the drain",
    "MBX10EA880":"KKS: MBX10EA880\nTEXT: FG TURB PROT TEST\nSTATUS: FAULT\nREASON: Group alarm. Either: Speed during live over-speed test has exceeded 3420rpm (or) Tolerance time during protection test sequence has been exceeded (or) Alarm MBX01EA801\nACTION: Ensure speed is reduced imediately to 3000rpm (automatic command). Shut down the unit. Check that emergency oil line to over-speed trip device is not blocked. Contact ABB. Using POS display and FG Test Channel diagrams investigate in which step and for what reason sequence has failed. See alarm MBX01EA801",
    "MBX21EA801":"KKS: MBX21EA801\nTEXT: POWER OIL SUPPLY\nSTATUS: FAULT\nREASON: Power oil pressure is not higher than 35 bar within 10 seconds of F.G. ON order\nACTION: Check system, in particular ensuring that filter ventilation and drainage valves are closed. Check pressure by measurement. Check pressure regulator MBX21DP001 if pressure incorrect. Check pressure switch if measured pressure is correct",
    "MBX21CP002":"KKS: MBX21CP002\nTEXT: DP LP-POW-OIL FILTER\nSTATUS: > MAX\nREASON: Power oil filter differential is higher than 1.2 bar\nACTION: Change-over to stand-by power oil filter and clean the dirty filter",
    "MBY00EA801":"KKS: MBY00EA801\nTEXT: FUEL-LIQ VALVES\nSTATUS: N.CLOSED\nREASON: One or more of the fuel liquid valves are not in closed position during gas opeartion or standstill(Exception: MBN32AA007 is held partially open during gas operation for cooling)\nACTION: Check by using the C&I daigrams, which valve is not clesed (C&I,Section 16: FG Fuel selection). Check, locally, position of faulty valve and investigate reason why valve did not close. If valve is in closed position, check limit switches of corresponding valve.",
    "MBY00EA802":"KKS: MBY00EA802\nTEXT: P BEF FUEL OIL PUMP\nSTATUS: < MIN\nREASON: Fuel suply pressure before fuel oil pump is less than 7 bar with booster pump ON\nACTION: Check that forwarding pump(s) are running. Check that all system hand valves are correctly positioned",
    "MBY00EA804":"KKS: MBY00EA804\nTEXT: P BEF GAS MAIN STOP VLV\nSTATUS: < MIN\nREASON: Gas supply pressure before gas main stop valve, MBP31AA001, is less than x bar with valve open. Note: With unit on line this signal will automatically initiate a fuel change-over to diesel. X=23bar for GT-11 GT-21 and x=22bar for GT-12 GT-22 and x=21bar for GT-13 GT-23\nACTION: Check that hand valve MBP31AA010 is fully open. Verify with ARCO that the gas reducing station is in normal operating condition. Check settings of gas reducing station (refer to O&M manuals & final setting)",
    "MBY00EA805":"KKS: MBY00EA805\nTEXT: FUEL-GAS VALVES\nSTATUS: N.CLOSED\nREASON: One or more of the fuel gas valves are not in shut-down position during oil operation or standstill within 60seconds of order for gas main stop valve to close\nACTION: Check by using the C&I digrams, which valve is not closed (C&I, Section 16:FG Fuel Selection). Check, locally, position of faulty valve and investigate reason why valve did not close. If valve is in closed position, check limit switches of corresponding valve",
    "MBY00EA806":"KKS: MBY00EA806\nTEXT: GAS RELIEF VACUUM\nSTATUS: < LOW\nREASON: Vacuum in gas control cabinet is less than 2mbar with gas main stop valve MBP31AA001 open\nACTION: Check that all doors of gas control cabinet are closed and secure. Verify that gas relief fan MBP33AN001 is in opearartion.",
    "MBY00EA807":"KKS: MBY00EA807\nTEXT: FUEL-LIQUID DRAIN VALV\nSTATUS: N.CLOSED\nREASON: Combustion chamber liquid drain valve not closed, with central power oil established for more than 10 seconds\nACTION: Check power oil supply. Check function of valve. Check position of limit switch",
    "MBY10DA802":"KKS: MBY10DA802\nTEXT: ACT POWER MEASUREMENT\nSTATUS: FAULT\nREASON: Channel difference between channels 1 and 2 of compressor delivery pressure is higher than 3% for more than 2 seconds\nACTION: Check both incoming power signals and locate fault",
    "MBY10DA805":"KKS: MBY10DA805\nTEXT: GT-CONTROLLER\nSTATUS: FAULT\nREASON: GT simulator switched on (or) Either both positioning controller(s) are not reset (or) Speed measuring disturbed (or) Active power measurement fault (or) Compressor discharge pressure measuring fault (or) Exhaust gas temperature measurement fault\nACTION: Switch off GT simulator. Reset positioning controller(s), LT5410 (red lamp on front panel must be illuminated). Check speed measuring circuits (refer also to electrical wiring diagrams). Check active power signal to correctness. Check the signals from both exhaust gas temperature transmitters",
    "MBY10DS502":"KKS: MBY10DS502\nTEXT: SPEED WINDOW CH DIFF\nSTATUS: ACTIV\nREASON: Channel difference between channel 1 and channel 2 of speed measuring\nACTION: Check signalling loops from the speed pick-ups to LCR for continuity. Check that speed pick-ups are functioning. Trouble shoot transmitters and monitors in accordance with O&M manual module descriptions",
    "MBY10DT502":"KKS: MBY10DT502\nTEXT: EXH-GAS TEMP MEASUREMENT\nSTATUS: FAULT\nREASON: Channel difference between channels 1 and 2 of exhaust gas temperature measurement is higher than 1.5%\nACTION: Check both incoming temperature signals/systems and locale fault",
    "MBY10DU500":"KKS: MBY10DU500\nTEXT: ACT POWER LIMITATION\nSTATUS: ACTIVAT\nREASON: Active Power limitation of 190 MW reached\nACTION: Investigate for reason how active power could reach the limit",
    "MKA13CL001":"KKS: MKA13CL001\nTEXT: LEVEL LEAK GEN\nSTATUS: > HIGH\nREASON: Generator water leakage detector(s) has activated\nACTION: Deload and shut down unit immediately. Earth generator and enter base frame through inspection hatches to ascertain source of leakage. Rectify and normalize system. Remove water from detector pits and ensure drain valve is re-closed",
    "MKC10DE000":"KKS: MKC10DE000\nTEXT: VOLTAGE REGULATOR\nSTATUS: MAN\nREASON: Voltage regulator in manual channel operating mode; either manually selected or due to automatic change-over from automatic channel\nACTION: If change-over was automatic investigate fault of automatic channel (refer to local excitation indication panel). If fault cleared the excitation can be changed back to automatic channel",
    "MKC10DE010":"KKS: MKC10DE010\nTEXT: LOAD ANGLE LIMITER\nSTATUS: IN OP\nREASON: Load angle limiter in operation\nACTION: Raise the reference value (set-point) for generator voltage until limiter is out of operation",
    "MKC10DE010":"KKS: MKC10DE010\nTEXT: ROTOR CURRENT LIMITER\nSTATUS: IN OP\nREASON: Rotor current limiter in operation\nACTION: Lower the reference value (set-point) for generator voltage until limiter is out of operation",
    "MKC10DE010":"KKS: MKC10DE010\nTEXT: STATOR CURRENT LIMITER\nSTATUS: IN OP\nREASON: Stator current limiter in operation\nACTION: Inductive stator current limiter in operation: lower the reference value(set-point) for generator voltage until limiter is out of operation. Capacitive stator current limiter in operation: raise the reference value (set point) for generator voltage until limiter is out of operation",
    "MKC10EG011":"KKS: MKC10EG011\nTEXT: EXCIT EQUIPMENT\nSTATUS: WARN\nREASON: Common warning announcement from the excitation system\nACTION: Identify the reason fpr the alarm (refer to electrical diagrams). After solving the problems, reset alarm at the local excitation alarm panel",
    "MKC10EG012":"KKS: MKC10EG012\nTEXT: EXCIT EQUIPMENT\nSTATUS: FAULT\nREASON: Common fault announcement from the excitation system\nACTION: Identify reason for the trip of the excitation system (refer to excitation system local alarm panel as well as the electrical diagrams) and solve the problem",
    "MKD10CY020":"KKS: MKD10CY020\nTEXT: VIBR BRG GEN DE VERT\nSTATUS: > HIGH\nREASON: Vibrations at generator driven side bearing, in vertical plane, are higher than 8 mm/s\nACTION: Verify rading by cross check/calibration. Contact ABB",
    "MKD10CY021":"KKS: MKD10CY021\nTEXT: VIBR BRG GEN DE HORIZ\nSTATUS: > HIGH\nREASON: Vibrations at generator driven side bearing, in horizontal plane, are higher than 8 mm/s\nACTION: Verify rading by cross check/calibration. Contact ABB",
    "MKD20CY020":"KKS: MKD20CY020\nTEXT: VIBR BRG GEN NDE VERT\nSTATUS: > HIGH\nREASON: Vibrations at generator non driven side bearing, in vertical plane, are higher than 8 mm/s\nACTION: Verify rading by cross check/calibration. Contact ABB",
    "MBY20CY021":"KKS: MBY20CY021\nTEXT: VIBR BRG GEN NDE HORIZ\nSTATUS: > HIGH\nREASON: Vibrations at generator non driven side bearing, in horizontal plane, are higher than 8 mm/s\nACTION: Verify rading by cross check/calibration. Contact ABB",
    "MKY01EA111":"KKS: MKY01EA111\nTEXT: SEL MODULE GRID CB\nSTATUS: MAN\nREASON: Synchronizing selection key for grid breaker is set to MANUAL position\nACTION: If manual synchronization is not intended, put key selector switch back to AUTO position",
    "MKY01EG801":"KKS: MKY01EG801\nTEXT: CHAN MONIT 1 MAN OPE\nSTATUS: ACTIV\nREASON: First channel of manual synchronizing supervision for grid circuit breaker closing actuated\nACTION: Contact ABB",
    "MKY01EG802":"KKS: MKY01EG802\nTEXT: CONTACT MONIT SYN GCB\nSTATUS: FAULT\nREASON: Channel supervision for synchronizing of grid circuit breaker out of service or disturbed\nACTION: Contact ABB",
    "MKY01EG803":"KKS: MKY01EG803\nTEXT: SYN GRID CIRC BREAKER\nSTATUS: FAULT\nREASON: The 3 minute time frame for synchronizing of grid circuit breaker has expired(first channel)\nACTION: Restart synchronizing sequence. Check green indication lamp on top of operator's local panel for close order from synchronizing panel. If lamp illuminates, but grid circuit breaker does not close, check wiring ON order of grid circuit breaker",
    "MKY01EG804":"KKS: MKY01EG804\nTEXT: GEN VOLT-GRID VOLT\nSTATUS: > MAX\nREASON: Difference between grid and general voltage is too high (first channel)\nACTION: Check both voltages on double voltage meter, localted on operator's local panel, and determine if fault is with excitation system or the grid. If necessary, shut down and adjust voltage with off-line tap changer of main transformer",
    "MKY01GS101":"KKS: MKY01GS101\nTEXT: CHAN MONIT 2 MAN OPE\nSTATUS: ACTIV\nREASON: Second channel of manual synchronizing supervision for grid circuit breaker closing actuated\nACTION: Contact ABB",
    "MKY01GS101":"KKS: MKY01GS101\nTEXT: GRID CIRC BREAK AUX VO\nSTATUS: TRIPD\nREASON: Control voltage for grid breaker disturbed\nACTION: Check control of grid breaker in the GIS building",
    "MKY01EA111":"KKS: MKY01EA111\nTEXT: SEL MODULE GEN CB\nSTATUS: MAN\nREASON: Synchronizing selection key for generator breaker is set to MANUAL position\nACTION: If manual synchronization is not intended, put key selector switch back to AUTO position",
    "MKY02EG801":"KKS: MKY02EG801\nTEXT: CHAN MONIT 1 MAN OPE\nSTATUS: ACTIV\nREASON: First channel of manual synchronizing supervision for generator circuit breaker closing actuated\nACTION: Contact ABB",
    "MKY02EG802":"KKS: MKY02EG802\nTEXT: CONT MONIT SYNC GEN CB\nSTATUS: FAULT\nREASON: Channel supervision for synchronizing of generator circuit breaker out of service or disturbed\nACTION: Contact ABB",
    "MKY02EG803":"KKS: MKY02EG803\nTEXT: SYN GEN CIRC BREAK\nSTATUS: FAULT\nREASON: The 3 minute time frame for synchronizing of generator circuit breaker has expired(first channel)\nACTION: Restart synchronizing sequence. Check green indication lamp on top of operator's local panel for close order from synchronizing panel. If lamp illuminates, but generator circuit breaker does not close, check wiring ON order of generator circuit breaker",
    "MKY02EG804":"KKS: MKY02EG804\nTEXT: GEN VOLT-GRID VOLT\nSTATUS: > MAX\nREASON: Difference between grid and generator voltage is too high (second channel)\nACTION: Check both voltages on double voltage meter, localted on operator's local panel, and determine if fault is with excitation system or the grid. If necessary, shut down and adjust voltage with off-line tap changer of main transformer",
    "MKY02GS101":"KKS: MKY02GS101\nTEXT: CHAN MONIT 2 MAN OPE\nSTATUS: ACTIV\nREASON: Second channel of manual synchronizing supervision for generator circuit breaker closing actuated\nACTION: Contact ABB",
    "MKY02GS101":"KKS: MKY02GS101\nTEXT: GEN CIRC BREAK AUX VO\nSTATUS: TRIPD\nREASON: Control voltages for ON/OFF circuits generator breaker disturbed. Supply 220Vdc incoming to CTA01 failure. Supply 24 Vdc incoming to CTA01 failure\nACTION: Check at the generator breaker module +CTA01 the following fuse breakers: Q401, Q402, Q511, Q512(refer to electrical diagrams)",
    "PCB70CT002":"KKS: PCB70CT002\nTEXT: COOLING WATER TEMPERATURE\nSTATUS: > HIGH\nREASON: Temperature of generator cooling water, after pumps, is higher than 65deg C\nACTION: Check that all cooling fans are in service. If necessary investigate reason for MCB tripping and reset. Check cleanliness of coolers and, if necessary, clean coolers",
    "SAB10AN010":"KKS: SAB10AN010\nTEXT: AIR CONDITION\nSTATUS: FAULT\nREASON: Common alarm indication from air conditioning unit for local control alarm\nACTION: Check local indications on air conditioning to locale the disturbance and solve problem in accordance with air conditioning maintanance instructions",
    "UMB00GW001":"KKS: UMB00GW001\nTEXT: PROXIMITY SENSOR\nSTATUS: DIST\nREASON: One or more of the gas cubicle proximity sensors(Namurs) is in disturbance\nACTION: Check isolation amplifiers in marshaling cubicle UMB00 to determine defect element. Replace as required"

}
